<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#5-数据预处理" data-toc-modified-id="5-数据预处理-1">5 数据预处理</a></span><ul class="toc-item"><li><span><a href="#5.1-缺失值处理" data-toc-modified-id="5.1-缺失值处理-1.1">5.1 缺失值处理</a></span><ul class="toc-item"><li><span><a href="#5.1.1-缺失值查看" data-toc-modified-id="5.1.1-缺失值查看-1.1.1">5.1.1 缺失值查看</a></span></li><li><span><a href="#5.1.2-缺失值删除" data-toc-modified-id="5.1.2-缺失值删除-1.1.2">5.1.2 缺失值删除</a></span></li><li><span><a href="#5.1.3-缺失值填充" data-toc-modified-id="5.1.3-缺失值填充-1.1.3">5.1.3 缺失值填充</a></span></li></ul></li><li><span><a href="#5.2-重复值处理" data-toc-modified-id="5.2-重复值处理-1.2">5.2 重复值处理</a></span></li><li><span><a href="#5.3-异常值的检测与处理" data-toc-modified-id="5.3-异常值的检测与处理-1.3">5.3 异常值的检测与处理</a></span><ul class="toc-item"><li><span><a href="#5.3.1-异常值检测" data-toc-modified-id="5.3.1-异常值检测-1.3.1">5.3.1 异常值检测</a></span></li><li><span><a href="#5.3.2-异常值处理" data-toc-modified-id="5.3.2-异常值处理-1.3.2">5.3.2 异常值处理</a></span></li></ul></li><li><span><a href="#5.4-数据类型转换" data-toc-modified-id="5.4-数据类型转换-1.4">5.4 数据类型转换</a></span><ul class="toc-item"><li><span><a href="#5.4.1-数据类型" data-toc-modified-id="5.4.1-数据类型-1.4.1">5.4.1 数据类型</a></span></li><li><span><a href="#5.4.2-类型转换" data-toc-modified-id="5.4.2-类型转换-1.4.2">5.4.2 类型转换</a></span></li></ul></li><li><span><a href="#5.5-索引设置" data-toc-modified-id="5.5-索引设置-1.5">5.5 索引设置</a></span><ul class="toc-item"><li><span><a href="#5.5.1-为无索引表添加索引" data-toc-modified-id="5.5.1-为无索引表添加索引-1.5.1">5.5.1 为无索引表添加索引</a></span></li><li><span><a href="#5.5.2-重新设置索引" data-toc-modified-id="5.5.2-重新设置索引-1.5.2">5.5.2 重新设置索引</a></span></li><li><span><a href="#5.5.3-重命名索引" data-toc-modified-id="5.5.3-重命名索引-1.5.3">5.5.3 重命名索引</a></span></li><li><span><a href="#5.5.4-重置索引" data-toc-modified-id="5.5.4-重置索引-1.5.4">5.5.4 重置索引</a></span></li></ul></li></ul></li></ul></div>

# 5 数据预处理

## 5.1 缺失值处理

缺失值就是由某些原因导致部分数据为空，对于为空的这部分数据我们一般有两种处理方式：
- 删除，把含有缺失值的数据删除
- 填充，把缺失的那部分数据用某个值代替

### 5.1.1 缺失值查看

Python中缺失值一般用`NaN`表示，从用`info()`方法的结果来看,

In [14]:
import pandas as pd

df = pd.read_excel('data/5.1.xlsx')
df

    编号    年龄   性别       注册时间
0   A1  54.0    男 2018-08-08
1   A2  16.0  NaN 2018-08-09
2  NaN   NaN  NaN        NaT
3   A3  47.0    女 2018-08-10
4   A4  41.0    男 2018-08-11

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
编号      4 non-null object
年龄      4 non-null float64
性别      3 non-null object
注册时间    4 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 288.0+ bytes

性别这一列是3 `non-null object`，表示性别这一列有3个非null值，而其他列有4个非null值，说明性别这一列有1个null值

还可以用`isnull()`方法来判断哪个值是缺失值，如果是缺失值则返回`True`，如果不是缺失值则返回`False`

In [16]:
df.isnull()

      编号     年龄     性别   注册时间
0  False  False  False  False
1  False  False   True  False
2   True   True   True   True
3  False  False  False  False
4  False  False  False  False

### 5.1.2 缺失值删除

缺失值分为两种，一种是一行中某个字段是缺失值；另一种是一行中的字段全部为缺失值，即为一个空白行

在 Python 中，我们利用的是 `dropna()`方法，**`dropna()`方法默认删除含有缺失值的行，也就是只要某一行有缺失值就把这一行删除**。

In [17]:
df

    编号    年龄   性别       注册时间
0   A1  54.0    男 2018-08-08
1   A2  16.0  NaN 2018-08-09
2  NaN   NaN  NaN        NaT
3   A3  47.0    女 2018-08-10
4   A4  41.0    男 2018-08-11

In [18]:
df.dropna()

   编号    年龄 性别       注册时间
0  A1  54.0  男 2018-08-08
3  A3  47.0  女 2018-08-10
4  A4  41.0  男 2018-08-11

运行`dropna()`方法以后，删除含有NaN值的行，返回删除后的数据。

**如果想删除空白行，只要给`dropna()`方法传入一个参数`how = all`即可，这样就会只删除那些全为空值的行，不全为空值的行就不会被删
除**。

In [19]:
df.dropna(how='all')

   编号    年龄   性别       注册时间
0  A1  54.0    男 2018-08-08
1  A2  16.0  NaN 2018-08-09
3  A3  47.0    女 2018-08-10
4  A4  41.0    男 2018-08-11

上表第二行中只有性别这个字段是空值，所以在利用`dropna(how ="all")`的时候并没有删除第二行

### 5.1.3 缺失值填充

在Python中，我们利用的`fillna()`方法对数据表中的所有缺失值进行填充，在`fillna`后面的括号中输入要填充的值即可

In [20]:
df

    编号    年龄   性别       注册时间
0   A1  54.0    男 2018-08-08
1   A2  16.0  NaN 2018-08-09
2  NaN   NaN  NaN        NaT
3   A3  47.0    女 2018-08-10
4   A4  41.0    男 2018-08-11

In [21]:
df.fillna(0)

   编号    年龄 性别                 注册时间
0  A1  54.0  男  2018-08-08 00:00:00
1  A2  16.0  0  2018-08-09 00:00:00
2   0   0.0  0                    0
3  A3  47.0  女  2018-08-10 00:00:00
4  A4  41.0  男  2018-08-11 00:00:00

在 Python 中我们也可以按不同列填充，只要在 `fillna()`方法的括号中指明列名即可。

In [22]:
df

    编号    年龄   性别       注册时间
0   A1  54.0    男 2018-08-08
1   A2  16.0  NaN 2018-08-09
2  NaN   NaN  NaN        NaT
3   A3  47.0    女 2018-08-10
4   A4  41.0    男 2018-08-11

In [23]:
df.fillna({'性别':'男'})

    编号    年龄 性别       注册时间
0   A1  54.0  男 2018-08-08
1   A2  16.0  男 2018-08-09
2  NaN   NaN  男        NaT
3   A3  47.0  女 2018-08-10
4   A4  41.0  男 2018-08-11

也可以同时对多列填充不同的值

In [24]:
df.fillna({'性别':'男','年龄':'30'})

    编号  年龄 性别       注册时间
0   A1  54  男 2018-08-08
1   A2  16  男 2018-08-09
2  NaN  30  男        NaT
3   A3  47  女 2018-08-10
4   A4  41  男 2018-08-11

## 5.2 重复值处理

重复数据就是同样的记录有多条，对于这样的数据我们一般做删除处理。

在Python中我们利用`drop_duplicates()`方法，该方法默认对所有值进行重复值判断，且默认保留第一个（行）值。

In [36]:
df = pd.read_excel('data/5.2.xlsx')
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [26]:
df.drop_duplicates()

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

上面的代码是针对所有字段进行的重复值判断,
<br>**同样也可以只针对某一列或某几列进行重复值删除的判断，只需要在`drop_duplicates()`方法中指明要判断的列名即可**。

In [31]:
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [27]:
df.drop_duplicates(subset='唯一识别码')

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11

**也可以利用多列去重，只需要把多个列名以列表的形式传给参数`subset`即可**。比如按姓名和唯一识别码去重。

In [30]:
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [29]:
df.drop_duplicates(subset=['客户姓名','唯一识别码'])

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11

**还可以自定义删除重复项时保留哪个，默认保留第一个，也可以设置保留最后一个，或者全部不保留。通过传入参数`keep`进行设置**。

参数`keep`默认值是`first`，即保留第一个值；也可以是`last`，保留最后一个值；**还可以是`False`，即把重复值全部删除**.

In [32]:
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [34]:
# 保留最后一个重复值
df.drop_duplicates(subset = ['客户姓名','唯一识别码'],keep='last')

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
3   A3   孙凤    103 2018-08-10
5   A5   赵恒    104 2018-08-11

In [37]:
# 不保留任何重复值
df.drop_duplicates(subset=['客户姓名','唯一识别码'],keep=False)

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09

## 5.3 异常值的检测与处理

**异常值就是相比正常数据而言过高或过低的数据**，比如一个人的年龄是0岁或者300岁都算是一个异常值，因为这和实际情况差距过大

### 5.3.1 异常值检测

要处理异常值首先要检测，也就是发现异常值，发现异常值的方式主要有以下三种：
- 根据业务经验划定不同指标的正常范围，超过该范围的值算作异常值
- 通过绘制箱形图，把大于（小于）箱形图上边缘（下边缘）的点称为异常值
- 如果数据服从正态分布，则可以**利用3σ 原则**；**如果一个数值与平均值之间的偏差超过3倍标准差，那么我们就认为这个值是异常值**

### 5.3.2 异常值处理

对于异常值一般有以下几种处理方式：
- 最常用的处理方式就是删除
- 把异常值当作缺失值来填充
- 把异常值当作特殊情况，研究异常值出现的原因

**Python中是通过过滤的方法对异常值进行删除**。比如 df 表中有年龄这个指标，要把年龄大于200的值删掉，你可以通过筛选把年龄不大于200的
筛出来，筛出来的部分就是删除大于200的值以后的新表。
<br>**对异常值进行填充，就是对异常值进行替换，利用`replace()`方法可以对特定的值进行替换**.

```diff
- 关于数据筛选和数据替换会在接下来的章节介绍
```

## 5.4 数据类型转换

### 5.4.1 数据类型

Pandas的数据类型不像Excel分得那么详细，它主要有6种数据类型，如下表所示：
```
类型                    说明
————————————————————————————————————————————————————————————————
int                     整数型，即整数
float                   浮点数，即含有小数点的数
object                  Python灯箱类型，用O表示
string                  字符串类型，经用用S表示，S10表示长度为10的字符串
unicode                 固定长度的unicode类型，跟字符串定义方式一样
datatime64(ns)          表示时间格式
```
**在 Python 中，不仅可以用 `info()`方法获取每一列的数据类型，还可以通过 `dtype`方法来获取某一列的数据类型**

In [38]:
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [39]:
df['订单编号'].dtype

dtype('O')

In [40]:
df['唯一识别码'].dtype

dtype('int64')

### 5.4.2 类型转换

我们在前面说过，不同数据类型的数据可以做的事情是不一样的，所以我们需要对数据进行类型转化，把数据转换为我们需要的类型。

在Python中，我们**利用`astype()`方法对数据类型进行转换，`astype`后面的括号里指明要转换的目标类型即可**。

In [41]:
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [44]:
df['唯一识别码'].dtype

dtype('int64')

In [45]:
df['唯一识别码'].astype('float64')

0    101.0
1    102.0
2    103.0
3    103.0
4    104.0
5    104.0
Name: 唯一识别码, dtype: float64

## 5.5 索引设置

索引是查找数据的依据，设置索引的目的是便于我们查找数据。

### 5.5.1 为无索引表添加索引

在Python中，如果表没有索引，会默认用从0开始的自然数做索引。如下：

In [53]:
df = pd.read_excel('data/5.2.xlsx',header=None,skiprows=1)
df

    0   1    2          3
0  A1  张通  101 2018-08-08
1  A2  李谷  102 2018-08-09
2  A3  孙凤  103 2018-08-10
3  A3  孙凤  103 2018-08-10
4  A4  赵恒  104 2018-08-11
5  A5  赵恒  104 2018-08-11

**通过给表df的`columns`参数传入列索引值，`index`参数传入行索引值达到为无索引表添加索引的目的**，具体实现如下

In [54]:
df

    0   1    2          3
0  A1  张通  101 2018-08-08
1  A2  李谷  102 2018-08-09
2  A3  孙凤  103 2018-08-10
3  A3  孙凤  103 2018-08-10
4  A4  赵恒  104 2018-08-11
5  A5  赵恒  104 2018-08-11

In [55]:
# 为表添加列索引
df.columns = ['订单编号','客户姓名','唯一识别码','成交时间']
df

  订单编号 客户姓名  唯一识别码       成交时间
0   A1   张通    101 2018-08-08
1   A2   李谷    102 2018-08-09
2   A3   孙凤    103 2018-08-10
3   A3   孙凤    103 2018-08-10
4   A4   赵恒    104 2018-08-11
5   A5   赵恒    104 2018-08-11

In [56]:
# 为表添加行索引
df.index = [1,2,3,4,5,6]
df

  订单编号 客户姓名  唯一识别码       成交时间
1   A1   张通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孙凤    103 2018-08-10
4   A3   孙凤    103 2018-08-10
5   A4   赵恒    104 2018-08-11
6   A5   赵恒    104 2018-08-11

### 5.5.2 重新设置索引

**重新设置索引，一般指行索引的设置**。__有的表虽然有索引，但不是我们想要的索引__，比如现在有一个表是把序号作为行索引，而我们想要把订单编号作为行索引，该怎么实现呢？

**在Python中可以利用`set_index()`方法重新设置索引列，在`set_index()`里指明要用作行索引的列的名称即可**

In [57]:
df

  订单编号 客户姓名  唯一识别码       成交时间
1   A1   张通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孙凤    103 2018-08-10
4   A3   孙凤    103 2018-08-10
5   A4   赵恒    104 2018-08-11
6   A5   赵恒    104 2018-08-11

In [59]:
df.set_index('订单编号')

     客户姓名  唯一识别码       成交时间
订单编号
A1     张通    101 2018-08-08
A2     李谷    102 2018-08-09
A3     孙凤    103 2018-08-10
A3     孙凤    103 2018-08-10
A4     赵恒    104 2018-08-11
A5     赵恒    104 2018-08-11

**在重新设置索引时，还可以给 `set_index()`方法传入两个或多个列名**，我们把这种一个表中用多列来做索引的方式称为层次化索引，层次化索引一般用在某一列中含有多个重复值的情况下。

层次化索引的例子，如下所示，其中 a、b、c、d 分别有多个重复值。
```text
a  1   1
   2   2
   3   3
b  1   4
   2   5
c  3   6
   1   7
d  2   8
   3   9
dtype: int32
```

### 5.5.3 重命名索引

**在Python中重命名索引，我们利用的是`rename()`方法，在`rename`后的括号里指明要修改的行索引及列索引名**

In [61]:
df

  订单编号 客户姓名  唯一识别码       成交时间
1   A1   张通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孙凤    103 2018-08-10
4   A3   孙凤    103 2018-08-10
5   A4   赵恒    104 2018-08-11
6   A5   赵恒    104 2018-08-11

In [63]:
# 重命名列索引
df.rename(columns={'订单编号':'新订单编号','客户姓名':'新客户姓名'})

  新订单编号 新客户姓名  唯一识别码       成交时间
1    A1    张通    101 2018-08-08
2    A2    李谷    102 2018-08-09
3    A3    孙凤    103 2018-08-10
4    A3    孙凤    103 2018-08-10
5    A4    赵恒    104 2018-08-11
6    A5    赵恒    104 2018-08-11

In [64]:
# 重命名行索引
df.rename(index={1:'一',2:'二',3:'三',4:'四'})

  订单编号 客户姓名  唯一识别码       成交时间
一   A1   张通    101 2018-08-08
二   A2   李谷    102 2018-08-09
三   A3   孙凤    103 2018-08-10
四   A3   孙凤    103 2018-08-10
5   A4   赵恒    104 2018-08-11
6   A5   赵恒    104 2018-08-11

In [66]:
df

  订单编号 客户姓名  唯一识别码       成交时间
1   A1   张通    101 2018-08-08
2   A2   李谷    102 2018-08-09
3   A3   孙凤    103 2018-08-10
4   A3   孙凤    103 2018-08-10
5   A4   赵恒    104 2018-08-11
6   A5   赵恒    104 2018-08-11

In [67]:
# 同时重命名行索引和列索引
df.rename(index={1:'一',2:'二',3:'三',4:'四'},columns={'订单编号':'新订单编号','客户姓名':'新客户姓名'})

  新订单编号 新客户姓名  唯一识别码       成交时间
一    A1    张通    101 2018-08-08
二    A2    李谷    102 2018-08-09
三    A3    孙凤    103 2018-08-10
四    A3    孙凤    103 2018-08-10
5    A4    赵恒    104 2018-08-11
6    A5    赵恒    104 2018-08-11

### 5.5.4 重置索引

**重置索引主要用在层次化索引表中，重置索引是将索引列当作一个`columns`进行返回**。

如下表：Z1、Z2是一个层次化索引
![image-20201214144423449](https://i.loli.net/2020/12/14/yF389iPwxteoXBn.png)

经过重置索引以后，Z1、Z2这两个索引以columns的形式返回，变为常规的两列，如下表

![image-20201214144643654](https://i.loli.net/2020/12/14/YMyWsLrfeK9p8gB.png)

**在Python利用的是`reset_index()`方法，`reset_index()`方法常用的参数如下**：
```python
reset_index(level=None,drop=False,inplace=False)
```
- `level`参数用来指定要将层次化索引的第几级别转化为`columns`,第一个索引为0级，第二个索引为1级，默认为全部索引，即默认把索引全
部转化为`columns`
- `drop`参数用来指定是否将原索引删掉，即不作为一个新的`columns`，默认为`False`，即不删除原索引
- `inplace`参数用来指定是否修改原数据表

**`reset_index()`方法常用于数据分组、数据透视表中**.